[
  {
    "id": "test-1",
    "name": "Sarah Johnson",
    "position": "Engineering Manager",
    "company": "Tech Corp",
    "relationship": "Direct Manager",
    "text": "Alex is an exceptional engineer who consistently delivers high-quality work. Their ability to architect scalable solutions and mentor junior developers makes them an invaluable team member. In their time here, they've led multiple critical projects and improved our team's velocity significantly.",
    "avatar": "/images/testimonials/sarah.jpg",
    "linkedinUrl": "https://linkedin.com/in/sarahjohnson",
    "date": "2024-10"
  },
  {
    "id": "test-2",
    "name": "Michael Chen",
    "position": "CTO",
    "company": "StartupXYZ",
    "relationship": "Former CTO",
    "text": "Alex joined us in the early stages and was instrumental in building our platform from the ground up. Their technical expertise and problem-solving skills helped us scale from 0 to 10,000+ users. They're not just a great developer, but also an excellent communicator and team player.",
    "avatar": "/images/testimonials/michael.jpg",
    "linkedinUrl": "https://linkedin.com/in/michaelchen",
    "date": "2021-01"
  },
  {
    "id": "test-3",
    "name": "Emily Rodriguez",
    "position": "Senior Frontend Developer",
    "company": "Tech Corp",
    "relationship": "Colleague",
    "text": "Working with Alex has been a fantastic learning experience. They have a deep understanding of both frontend and backend technologies, and they're always willing to share their knowledge. Their code reviews are thorough and educational, and they've helped me grow significantly as a developer.",
    "avatar": "/images/testimonials/emily.jpg",
    "linkedinUrl": "https://linkedin.com/in/emilyrodriguez",
    "date": "2024-08"
  },
  {
    "id": "test-4",
    "name": "David Park",
    "position": "Product Manager",
    "company": "Tech Corp",
    "relationship": "Product Manager",
    "text": "Alex is the rare engineer who understands both the technical and business sides of product development. They ask the right questions, propose innovative solutions, and always deliver on time. Their contributions have been critical to our product's success and user satisfaction.",
    "avatar": "/images/testimonials/david.jpg",
    "linkedinUrl": "https://linkedin.com/in/davidpark",
    "date": "2024-09"
  },
  {
    "id": "test-5",
    "name": "Jennifer Lee",
    "position": "UX Designer",
    "company": "Digital Solutions Inc",
    "relationship": "Former Colleague",
    "text": "Alex has an excellent eye for detail and user experience. They don't just implement designs—they improve them with thoughtful suggestions and technical insights. Our collaboration resulted in interfaces that users love and that are performant and maintainable.",
    "avatar": "/images/testimonials/jennifer.jpg",
    "date": "2019-03"
  }
]
